library(rio)
screening<-import('C:/Users/dell/Desktop/PAD8月9日.xlsx')
screening2<-within(screening,{
  area<-vector()
  qu<-vector()
  #示范区项目+早诊早治（试点街道）
  area[id<=31033000 & id>=31030001]<-'尖山街'
  area[id<=31063000 & id>=31060001]<-'下瓦房街'
  area[id<=31083000 & id>=31080001]<-'友谊路街'
  area[id<=31093000 & id>=31090001]<-'桃园街'
  area[id<=31073000 & id>=31070001]<-'越秀街'
  area[id<=31113000 & id>=31110001]<-'陈塘庄街'
  area[id<=33033000 & id>=33030001]<-'南营门街'
  area[id<=33043000 & id>=33040001]<-'新兴街'
  area[id<=34043000 & id>=34040001]<-'万兴街(东南)'
  area[id<=34053000 & id>=34050001]<-'水上公园街'
  area[id<=35033000 & id>=35030001]<-'二号桥街'
  area[id<=35053000 & id>=35050001]<-'大王庄街'
  area[id<=32023000 & id>=32020001]<-'别山镇'
  area[id<=32043000 & id>=32040001]<-'马伸桥镇'
  #早诊早治项目
  #河西区
  area[id>=31010001 & id<=31013000]<-"东海街"
  area[id>=31020001 & id<=31023000]<-"挂甲寺街"
  area[id>=31040001 & id<=31043000]<-"马场街"
  area[id>=31050001 & id<=31053000]<-"天塔街"
  area[id>=31100001 & id<=31103000]<-"柳林街"
  area[id>=31120001 & id<=31123000]<-"大营门街"
  qu[id>=31010001 & id<=31123000]<-'河西区'
  ###和平区
  area[id>=33010001 & id<=33013000]<-"小白楼街"
  area[id>=33020001 & id<=33023000]<-"南市街"
  area[id>=33050001 & id<=33053000]<-"五大道街"
  area[id>=33060001 & id<=33063000]<-"劝业场街"
  qu[id>=33010001 &id<=33063000]<-'和平区'
  ###南开区
  area[id>=34010001 & id<=34013000]<-"华苑街"
  area[id>=34020001 & id<=34023000]<-"王顶堤街"
  area[id>=34030001 & id<=34033000]<-"体育中心街"
  area[id>=34060001 & id<=34063000]<-"万兴街（三潭)"
  qu[id>=34010001 & id<=34063000 ]<-'南开区'
  ###河北区
  area[id>=36010001 & id<=36013000]<-"王串场街"
  area[id>=36020001 & id<=36023000]<-"鸿顺里街"
  area[id>=36030001 & id<=36033000]<-"月牙河街"
  area[id>=36050001 & id<=36053000]<-"铁东路街"
  area[id>=36040001 & id<=36043000]<-"建昌道街"
  area[id>=36060001 & id<=36063000]<-"宁园街"
  qu[id>=36010001 & id<=36063000]<-'河北区'
  ###河东区
  area[id>=35010001 & id<=35013000]<-"上杭路街"
  area[id>=35020001 & id<=35023000]<-"鲁山道街"
  area[id>=35040001 & id<=35043000]<-"唐家口街"
  area[id>=35060001 & id<=35063000]<-"富民路街"
  qu[id>=35010001 & id<=35063000]<-'河东区'
  ### 红桥区
  area[id>=37010001 & id<=37013000]<-"芥园道街"
  area[id>=37020001 & id<=37023000]<-"邵公庄街"
  area[id>=37030001 & id<=37033000]<-"和苑街"
  area[id>=37040001 & id<=37043000]<-"铃铛阁街"
  area[id>=37050001 & id<=37053000]<-"双环坉街"
  area[id>=37060001 & id<=37063000]<-"丁字沽街"
  qu[id>=37010001 & id<=37063000]<-'红桥区'
  ###蓟州区
  area[id>=32010001 & id<=32013000]<-"官庄镇"
  area[id>=32030001 & id<=32033000]<-"下营镇"
  area[id>=32050001 & id<=32053000]<-"桑梓镇"
  area[id>=32060001 & id<=32063000]<-"东二营镇"
  qu[id>=32010001 & id<=32063000]<-'蓟州区'
})
export(screening2,'C:/Users/dell/Desktop/街道赋值.xlsx')
export(screening2,'~/街道赋值.xlsx')
