library(tidyr)
#肝部占位
#占位类型：01.肝硬化, 02.门脉高压, 
#03.胆囊炎, 04.脾大, 05.腹水, 06.脂肪肝, 07.肝囊肿, 08.肝脓肿, 09.肝血管瘤, 10.肝占位性病变,
#11.肝癌, 12.门静脉栓塞, 13.肝胆管扩张, 14.未见异常,15.其他
liverBUS_inf<-function(word2){
肝硬化<-c('肝硬化','肝硬化待查','1考虑肝硬化','肝硬化伴结节','肝硬化结节','肝脏弥漫性病变（符合早期肝硬化声像图表现）','肝脏符合肝硬化征象')
脂肪肝<-c('轻度脂肪肝','脂肪肝','脂肪肝（轻度）' ,"轻到中度脂肪肝" ,"考虑非均匀性脂肪肝" ,'中度脂肪肝' ,'轻中度脂肪肝' ,
       "1.脂肪肝" ,'重度脂肪肝','轻度脂肪肝2' ,"非均匀性脂肪肝" ,"餐后胆囊；轻度脂肪肝" ,"中重度脂肪肝",
       '轻-中度脂肪肝','脂肪肝（中度）','不均匀脂肪肝','非均质脂肪肝','1脂肪肝','中度脂肪肝2','轻中度脂肪肝2',
       '非均质性脂肪肝','脂肪肝（轻-中度）','脂肪肝（轻中度）','1轻度脂肪肝','不均质脂肪肝','中-重度脂肪肝',
       '不匀质脂肪肝','脂肪肝（中重度）','脂肪肝（中）','脂肪肝（重度）','中到重度脂肪肝','考虑不均匀性脂肪肝',
       '脂肪肝（轻-中）','脂肪肝轻度','轻度脂肪肝3','0cm）中度脂肪肝','0cm脂肪肝','2轻中度脂肪肝','4cm）轻度脂肪肝',
       '9cm）轻度脂肪肝','不均匀性脂肪肝','不均匀性轻中度脂肪肝','不均匀脂肪肝（中-重度脂肪肝）','不均匀脂肪肝（轻度）',
       '不均质型脂肪肝','中度+脂肪肝','中度不均匀脂肪肝','中脂肪肝','其高难度脂肪肝','脂肪肝（不均匀型',
       '脂肪肝（不均匀性','脂肪肝（不均匀性）','脂肪肝（不均匀脂肪肝）','脂肪肝（中度）胆囊切除术后','脂肪肝（轻）',
       '脂肪肝（轻度)','脂肪肝（轻度）气体遮挡胆囊显示欠清','脂肪肝（非均质）','脂肪肝2','脂肪肝3','脂肪肝何建英',
       '脂肪肝其他未见明显异常','脂肪肝肝右叶中等回声区','脂肪肝高俊霞','轻-中脂肪肝','轻度脂肪肝（不均匀脂肪肝',
       '轻度脂肪肝吧','轻度脂肪肝肝','非均质性轻中度脂肪肝','轻度脂防肝','中中度脂肝','中度脂肪','中度脂防肝','中脂'
)
未见明显异常<-c('未见明显异常' ,'未见异常' ,'肝脏未见异常' ,'未见明显异常回声' ,
          '餐后胆囊；其他未见明显异常' ,"肝未见异常" ,"其他未见明显异常",'未见','未见异',
          'B超未见明显异常' ,'肝脏未见明显异常' ,"肝脏未见明显异常回声","1.未见异常",
          '上腹部未见明显占位' ,"肝脏未见异常回声" ,"肝脏未见明显与","肝未见明显异常",
          "肝形态未见异常" , "肝胆胰脾未见异常" , "未见异常回声" , 
          "肝胆胰脾未见明显异常" ,"上腹部未见异常" ,"上腹部未见明显异常",
          "上腹部未见占位" ,"肝胆未见异常",'肝胆脾胰未见异常','其他未见异常','上腹部未见明显异常占位',
          '脾未见异常','肝未见异常回声','肝胆脾胰未见明显异常','B未见明显异常','形态结构未见明显异常',
          '肝胰脾未见异常','1未见异常','其它未见明显异常','干未见明显异常','肝胆未见明显异常','1B超未见明显异常',
          '其它未见异常','双乳未见明显异常','双侧乳腺未见异常','安葬未见明显异常','未见异常2','未见明显有异常',
          '未见肝脏显异常','结构形态未见明显异常','肝未明显异常','肝未明显异常见','肝未见异常2','肝未见明显异常回声',
          '肝没见明显异常','肝胆未见明显异常回声','肝胆胰胰未见明显异常','肝胆胰脾未明显异常','肝脏可显示部分未见异常',
          '肝脏回声未见明显异常','肝脏无明显异常','肝脏是未见明显异常','肝脏未见明显异常家','胰脾未见明显异常',
          '脂肪肝其他未见明显异常','脾未见明显异常','肝未见明显异','肝胆胰脾未见明显'
)
肝囊肿<-c('肝多发囊肿','肝囊肿', "肝左叶囊肿", "肝小囊肿","肝囊肿（大小约1", 
       "肝内多发囊肿", "肝右叶囊肿","多发肝囊肿", "多发性肝囊肿",
       '肝囊肿','肝囊肿多发','肝囊肿（1','肝囊肿（多发）','肝囊肿（大小约0','多发肝囊肿（最大约1',
       '肝囊肿（大小约2','肝囊肿2','2肝囊肿','多发肝囊肿（最大约3','肝囊肿3','肝囊肿多发（1',
       '肝囊肿（直径约0','肝囊肿多发（2','肝左叶囊肿伴分隔','胰腺囊肿','肝内小囊肿','肝囊肿（0',
       '肝囊肿（单发）','肝左叶多发囊肿','胆囊壁囊肿','胆囊多发囊肿','胆囊肿大','1肝囊肿','右叶多发囊肿',
       '多发肝囊肿（最大1','多发肝囊肿（最大约2','多发肝囊肿（较大约1','肝内小囊肿（0','肝右叶多发囊肿',
       '肝囊肿（2','肝囊肿（大小约3','肝囊肿1','肝囊肿多发2','肝多发囊肿部分伴分隔','1肝囊肿多发2',
       '1肝多发囊肿','2cm）肝囊肿（大小约1','刚囊肿','右肾囊肿（4','囊肿结石','多发肝囊肿（最大约0',
       '多发肝囊肿（最大约4','多发肝囊肿（最大约5','干偶也囊肿','干囊肿','考虑肝囊肿',
       '肝内低回声区--考虑低脂区或囊肿','肝内多发低回声-囊肿不除外3','肝内多发囊肿4','肝右叶中段囊肿',
       '肝右叶囊肿伴分隔','肝囊肿（10','肝囊肿（2个）','肝囊肿（3','肝囊肿（内透声欠佳）','肝囊肿（最大约0',
       '肝囊肿（多发)','肝囊肿（多发）胆总管扩张（代偿性）','肝囊肿（大小约4','肝囊肿（大小约7',
       '肝囊肿（建议复查）','肝囊肿（直径约1','肝囊肿（约2','肝囊肿（较大为2','肝囊肿不除外','肝囊肿多发（3',
       '肝囊肿多发（4','肝囊肿多发（直径3','肝囊肿大小约2','肝囊肿胆囊显示不清','肝囊肿附壁结晶',
       '肝多发囊肿（最大0','肝多发囊肿（最大1','肝多发囊肿（最大约2','肝多发囊肿（最大约4',
       '肝多发囊肿（最大约6','肝多发囊肿3','肝多大囊肿（考虑多囊肝）','肝多夫囊肿','肝大叶囊肿','肝左右囊肿',
       '肝左叶小囊肿','肝脏多发囊肿','肝脏小囊肿（0','肝脾间囊性无回声--肝囊肿','胆囊肿','胆囊腺囊肿',
       '胆小囊肿','多囊肝'
)
胆囊结石<-c("胆囊结石", "胆囊多发结石", "胆结石", "肝内胆管结石",
'胆囊泥沙样结石','胆囊结石（泥沙样）','胆囊结石多发','胆囊结石（多发）','多发性胆囊结石',
'胆囊结石2','胆囊结石（0','胆囊壁间结石','胆囊结石（充满型）','胆囊结石（大小约0','胆囊颈部结石',
'胆囊充满型结石','胆囊结石（1','胆囊结石（直径约1','胆囊结石多发2','胆囊充满性结石',
'胆囊多发结石（最大直径约1','胆囊结石不除外','胆多发结石','充满型胆囊结石','充满型胆结石',
'右肝内胆管结石','多发胆囊结石','考虑胆囊结石','肝多发结石','胆囊多发结石（最大直径约0',
'胆囊多发结石（最大约1','胆囊多发结石（泥沙样）','胆囊多发结石3','胆囊多发结石4','胆囊结石伴炎症',
'胆囊结石多发（0','胆结石（多发）','胆结石（泥沙型）','脂肪肝胆囊结石','1cm）胆囊结石（1',
'1胆囊多发结石','1胆囊结石多发','2胆囊多发结石','充满型结石','单囊结石','囊肿结石','多发肝内胆管结石',
'多发胆囊结石（最大直径约0','多发胆囊结石（最大直径约1','多发胆囊结石（最大约0','多发胆囊结石（最大约1',
'多发胆结石','大幅多发胆囊结石','结石','考虑胆囊充满型结石','肝内强回声（不排除外胆管结石）',
'肝内强回声团——肝内胆管结石','肝内强回声点——胆管结石','肝内胆管多发结石','胆囊内强回声---沉积物?结石',
'胆囊壁泥沙样结石','胆囊多发结石（充满型）','胆囊多发结石（最大约0',
'胆囊多发结石（餐后可见','胆囊泥沙样结石不除外','胆囊泥沙样结石伴炎症','胆囊泥沙结石','胆囊流沙样结石',
'胆囊细碎结石','胆囊结石（充满型）3','胆囊结石（多发','胆囊结石（大小约1','胆囊结石（直径约0',
'胆囊结石（考虑充满型）','胆囊结石（餐后胆囊）','胆囊结石0','胆囊结石3','胆囊结石伴炎症（多发）',
'胆囊结石显示不清','胆囊结石考虑胆汁淤积','胆结石（泥沙样）','胆结石多发','胆结石建议复查'
)
胆囊切除<-c("胆囊切除术后","胆囊切除","胆切除",'胆切除术后')
脾大<-c("脾大","脾稍大","脾肿大","肝大",'）脾大','脾增大','脾轻大','脾轻度增大','9cm）脾略大')
胆囊息肉<-c("胆囊息肉","胆囊多发息肉","胆囊息肉样病变","胆囊息肉不除外",
        '胆息肉','符合胆囊息肉声像图表现','多发胆囊息肉','胆囊息肉（0','胆囊息肉0','胆囊息肉多发','胆囊息肉长径0',
        '胆囊息肉（直径约0','胆囊壁息肉样病变','胆囊息肉（直径3','胆囊息肉2','胆囊息肉样变','胆囊息肉（直径4',
        '考虑胆囊息肉','胆囊多发息肉--建议进一步检查','胆囊息肉（7','胆囊息肉（直径约3','脂肪肝胆囊息肉',
        '1cm）胆囊息肉（直径约0','9cm）胆囊多发息肉（最大直径约0','伴胆囊息肉','囊肿息肉','多发性胆囊息肉',
        '多发胆囊息肉（长约0','多发胆囊息肉较大长径0','息肉','息肉多发','符合胆囊息肉声像图','符合胆囊息肉的声像图表现',
        '考虑胆囊息肉（直径3','考虑胆囊息肉（直径约2','考虑胆囊息肉（直径约为4','考虑胆囊息肉直径26mm','肝内息肉',
        '肝囊肿脂肪肝胆息肉','胆囊内中强回声团（胆囊息肉','胆囊内中强回声结节（息肉','胆囊内稍强回声团--结石或息肉',
        '胆囊多发息肉（4','胆囊多发息肉（7','胆囊多发息肉（最大的0','胆囊多发息肉（最大直径：7',
        '胆囊多发息肉（最大直径0','胆囊多发息肉（最大直径约0','胆囊多发息肉（直径最大3','胆囊多发息肉（直径约11*11mm）',
        '胆囊多发息肉（较大一个直接约0','胆囊多发息肉（较大为0','胆囊多发息肉（较大为6','胆囊多发息肉（较大直径约为：2',
        '胆囊多发息肉（较大直径约为3mm）','胆囊多发息肉（较大约0','胆囊多发息肉3','胆囊多发息肉最大0','胆囊多发息肉样病变',
        '胆囊多发息肉样病变（较大约0','胆囊息肉（3','胆囊息肉（5','胆囊息肉（8*6mm）','胆囊息肉（共约0','胆囊息肉（直径0',
        '胆囊息肉（直径1','胆囊息肉（直径2','胆囊息肉（直径3mm）','胆囊息肉（直径6','胆囊息肉（直径8','胆囊息肉（直径为12',
        '胆囊息肉（直径约6*5mm）','胆囊息肉（直径约为4','胆囊息肉（较大直径约为2','胆囊息肉（长约0','胆囊息肉（餐后胆囊）',
        '胆囊息肉3','胆囊息肉4','胆囊息肉可能','胆囊息肉多发（0','胆囊息肉样变1','胆囊息肉较大约0','胆囊结晶伴胆囊息肉（直径约5',
        '胆囊结石伴胆囊息肉','胆囊胆固醇结晶伴胆囊息肉（直径约为4','胆多发息肉'
)
胆脓肿<-c('胆脓肿','胆囊脓肿','肝脓肿','胆脓肿','脂肪（中）')
肝血管瘤<-c('肝血管瘤','肝内血管瘤','考虑血管瘤','肝右叶血管瘤','考虑肝血管瘤','肝多发血管瘤',
        '肝内多发血管瘤','脾血管瘤','肝内血管瘤不除外','肝血管瘤（大小约1','血管瘤',
        '考虑肝内血管瘤','肝内中高回声团————血管瘤','肝血管瘤（多发）','5cm）肝血管瘤（直径约0',
        '右叶血管瘤','多发肝血管瘤','左叶有血管瘤','疑似血管瘤','考虑肝右叶血管瘤',
        '考虑肝多发血管瘤','考虑肝脏血管瘤','考虑血管瘤或手术所致','肝内中回声团块（考虑肝血管瘤）',
        '肝内中强回声团--血管瘤不除外','肝内中强回声团块（考虑肝血管瘤）','肝内中强回声团块（肝血管瘤',
        '肝内中强回声团块（肝血管瘤）','肝内中等回声区--考虑血管瘤','肝内中高回声团——血管瘤',
        '肝内低回声团块（考虑肝内血管瘤）','肝内低回声团块（考虑肝血管瘤）','肝内低回声结节-血管瘤不除外',
        '肝内占位考虑血管瘤','肝内多发不均匀回声团——-肝血管瘤','肝内多发偏强回声（血管瘤','肝内多发稍强回声灶(血管瘤',
        '肝内多发血管瘤2','肝内强回声（考虑血管瘤）','肝内稍低回声团——血管瘤','肝内稍低回声团（考虑血管瘤)',
        '肝内稍低回声团（考虑血管瘤）','肝内稍高回声团——血管瘤','肝内稍高回声团（考虑血管瘤）','肝内等回声区--血管瘤',
        '肝内考虑血管瘤','肝内血管瘤(0','肝内血管瘤（1','肝内血管瘤（最大约1','肝内血管瘤除外','肝内高回声结节（考虑血管瘤）',
        '肝内高回声考虑血管瘤','肝右叶小血管瘤','肝右叶血管瘤不除外','肝右叶高回声团--肝血管瘤','肝多发稍强回声团（血管瘤',
        '肝左叶中高回声团-血管瘤','肝左叶低回声区--血管瘤','肝左叶多发血管瘤','肝左叶血管瘤','肝的中强回声团块（考虑肝的血管瘤）',
        '肝脏中高回声团——血管瘤','肝脏内血管瘤','肝脏多发血管瘤','肝脏血管瘤多发','肝血管瘤（多发）建议进一步检查',
        '肝血管瘤（大小约0','肝血管瘤（直径约1','肝血管瘤可能','肝血管瘤多发','肝血管瘤待查','肝内低回声团（考虑血管肿瘤）'
)
肝占位性病变<-c('肝多发实性占位性病变（符合肝血管瘤声像图表现）','肝占位病变',
          '肝内占位性病变','肝右叶实性占位性病变（符合肝血管瘤声像图表现）',
          '肝实性占位性病变（符合肝血管瘤声像图表现）','肝实质占位性病变（符合肝血管瘤声像图表现）',
          '肝左叶实性占位性病变（符合肝血管瘤声像图表现）','肝占位性病变','肝左叶实性占位性病变',
          '1肝内占位性病变（性质待查）','肝右叶实性占位性病变','肝右叶实性占位性病变（符合血管瘤声像图表现）',
          '肝右叶实性占位性病变（肝血管瘤声像图表现）','肝多发实质性占位性病变（符合肝血管瘤声像图表现）',
          '肝实性占位性病变（肝血管瘤','肝左叶占位性病变','肝脏占位性病变',
          '肝脏多发实性占位性病变'
)
肝胆管扩张<-c('胆总管扩张','左肝内胆管扩张','肝内总胆管轻度扩张','肝内胆管扩张','胆总管扩张（代偿性）','胆管扩张')
胆囊炎<-c('慢性胆囊炎','胆囊炎','（胆囊炎）','明显胆囊炎','测量不清）慢性胆囊炎','符合慢性胆囊炎声像图表现','胆囊炎4','胆囊炎不除外'
)
腹水<-c('腹水','腹水原因待查','肝腹水')
肝癌<-c('肝实性占位性病变（符合肝CA声像图表现）')

other<-c('1）','2）','8）','9）','0*0','6*0','7*0',"(-)",'4cm','3cm','5cm','6cm','1*0','1*1','2cm','5*1',
'7cm','9*0','9cm','直径0','0*1','2*1','3*1','5*0','6*1','8*0','8*1','8cm','0x1','2*2','2x1','3*0',
'4*1','7*2','（-)','0*2','0x0','5*2','5*3','5x0','9*1','0cm','1*2','1x0','1x1','2x0','3*2','3x1','6*4',
'6x0','7*6','7mm','7x0','8*2','8x2','0*3','1*3','1*4','1cm','1x5','2*0','2*4','2x2','3*5','3*7','3x2',
'3x8','4*0','4*2','4*4','4*7','4mm','4x1','4X4','5*4','5mm','5x1','6*2','6mm','6x1','7*1','7*7','7x4',
'8*3','8*5','8mm','8x0','9*3','9x0','何建英','充满型','占位？','大小1','7cm）','4cm）','3cm）','6cm）',
'0cm）','5cm）','1cm）','2cm）','8cm）','9cm）','6mm）','建议复查','3mm）','大小约0','4mm）','大小约1',
'（-—）','2mm）','5cm)','7cm)','8cm)','8mm）','0cm)','0mm）','34cm','4cm)','5mm）','9cm)','9mm）',
'最大约0','(——）','（——)','1mm）','28cm','2cm)','31cm','3cm)','41cm','44cm','49cm','5*11','63x0','66x0',
'69*0','69x0','6cm)','75x0','7mm）','98x0','FNH？','（-——）','2cm）2','0cm）2','15cm）','2cm*3','3cm)2',
'3cm*2','3mm*6','43cm）','45cm）','4cm)3','5cm）2','5cm直径','6cm）2','6cm*2','6mm*2','7,mm）','7cm）2',
'80cm）','8cm)3','8cm*0','9cm）2','9cm*0','最大约为0','副脾直径0','宽约6mm','2*6cm）','3*7cm）','35cm）2',
'3cm（多发）','6cm（单发）','6X1,5cm）','副脾15*9mm','大小约0。8*0','（大小约1。9X1','（-）','（——）'," ",
'（0','（1',	'（大小约0','）2','最大0','最大1','最大3','最大直径0')
word2$类型<-ifelse(nchar(word2$类型)<=1,NA,word2$类型)
word2$类型<-ifelse(word2$类型 %in% 肝硬化,"肝硬化",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 脂肪肝,"脂肪肝",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 未见明显异常,"未见明显异常",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 肝囊肿,"肝囊肿",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 胆囊切除,"胆囊切除",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 脾大,"脾大",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 胆囊结石,"胆囊结石",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 胆囊息肉,"胆囊息肉",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 肝占位性病变,"肝占位性病变",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 肝血管瘤,"肝血管瘤",word2$类型) 
word2$类型<-ifelse(word2$类型 %in% 胆脓肿,"胆脓肿",word2$类型)
word2$类型<-ifelse(word2$类型 %in% 肝胆管扩张,"肝胆管扩张",word2$类型)
word2$类型<-ifelse(word2$类型 %in% 胆囊炎,"胆囊炎",word2$类型)
word2$类型<-ifelse(word2$类型 %in% 腹水,"腹水",word2$类型)
word2$类型<-ifelse(word2$类型 %in% 肝癌,"肝癌",word2$类型)
word2$类型<-ifelse(word2$类型 %in% other,NA,word2$类型) 
return(word2)
#
}
