library(jiebaR)
library(tidyr)
show_dictpath()
df<-c('轻度脂肪肝  肝囊肿')
df2<-c('肝多发囊肿 中度脂肪肝')
worker()->wk
segment(df,wk)
segment(df2,wk)
#肝部占位
#占位类型：01.肝硬化, 02.门脉高压, 
#03.胆囊炎, 04.脾大, 05.腹水, 06.脂肪肝, 07.肝囊肿, 08.肝脓肿, 09.肝血管瘤, 10.肝占位性病变,
#11.肝癌, 12.门静脉栓塞, 13.肝胆管扩张, 14.未见异常,15.其他
word<-liverBUS[,c('liverlump','ID_BLAST','livultrdia')]
word_list<-word%>%transmute(ID=ID_BLAST,占位=liverlump,诊断=livultrdia)%>%group_by(诊断)%>%summarise(n=n())%>%arrange(desc(n))
head(word_list,20)
word%>%transmute(ID=ID_BLAST,占位=factor(liverlump,levels = c(1,2),labels=c('占位:否','占位:是')),诊断=livultrdia)%>%group_by(占位,诊断)%>%
  summarise(n=n())%>%arrange(desc(n))%>%filter(n>30)%>%ggplot(aes(诊断,n, fill = 占位)) +
  geom_col(show.legend = FALSE) +
  facet_wrap(~占位, scales = "free_y") +
  theme(text=element_text(size=14))+
  coord_flip()
#重新赋值
##word2--pivot_longer转换
word2<-word%>%separate(livultrdia,c('占位1','占位2','占位3',"占位4"),sep="([\\.\\ \\；\\，\\、\\(\\)])",remove=FALSE)%>%
  pivot_longer(cols=c('占位1','占位2','占位3','占位4'),names_to = '占位',values_to = '类型')
word2$类型<-ifelse(nchar(word2$类型)<=1,NA,word2$类型)
head(word2,20)
word2$类型[word2$类型=='轻度脂肪肝' | word2$类型=='脂肪肝' |  word2$类型=='脂肪肝（轻度）' | word2$类型=="轻到中度脂肪肝" | word2$类型=="考虑非均匀性脂肪肝" |
           word2$类型=='中度脂肪肝' | word2$类型=='轻中度脂肪肝' | word2$类型=="1.脂肪肝" |  word2$类型=='重度脂肪肝' |word2$类型=='轻度脂肪肝2' | 
           word2$类型=="非均匀性脂肪肝" | word2$类型=="餐后胆囊；轻度脂肪肝" | word2$类型=="中重度脂肪肝"]<-'脂肪肝' 

脂肪肝<-c('轻度脂肪肝','脂肪肝','脂肪肝（轻度）' ,"轻到中度脂肪肝" ,"考虑非均匀性脂肪肝" ,'中度脂肪肝' ,'轻中度脂肪肝' ,
       "1.脂肪肝" ,'重度脂肪肝','轻度脂肪肝2' ,"非均匀性脂肪肝" ,"餐后胆囊；轻度脂肪肝" ,"中重度脂肪肝")



word2$类型[word2$类型=='未见明显异常' | word2$类型=='未见异常' | word2$类型=='肝脏未见异常' | word2$类型=='未见明显异常回声' | 
           word2$类型=='餐后胆囊；其他未见明显异常' | word2$类型=="肝未见异常" | word2$类型=="其他未见明显异常" |
           word2$类型=='B超未见明显异常' | word2$类型=='肝脏未见明显异常' | word2$类型=="肝脏未见明显异常回声" | 
           word2$类型=="1.未见异常" |  word2$类型=='上腹部未见明显占位' |word2$类型=="肝脏未见异常回声" | word2$类型=="肝脏未见明显与" |
           word2$类型=="肝未见明显异常" | word2$类型== "肝形态未见异常" | word2$类型== "肝胆胰脾未见异常" | word2$类型== "未见异常回声" | 
           word2$类型== "肝胆胰脾未见明显异常" | word2$类型=="上腹部未见异常" | word2$类型=="上腹部未见明显异常"| 
           word2$类型== "上腹部未见占位" | word2$类型=="肝胆未见异常"]<-'未见明显异常'
未见明显异常<-c('未见明显异常' ,'未见异常' ,'肝脏未见异常' ,'未见明显异常回声' ,
'餐后胆囊；其他未见明显异常' ,"肝未见异常" ,"其他未见明显异常",
'B超未见明显异常' ,'肝脏未见明显异常' ,"肝脏未见明显异常回声","1.未见异常",
'上腹部未见明显占位' ,"肝脏未见异常回声" ,"肝脏未见明显与","肝未见明显异常",
"肝形态未见异常" , "肝胆胰脾未见异常" , "未见异常回声" , 
"肝胆胰脾未见明显异常" ,"上腹部未见异常" ,"上腹部未见明显异常",
"上腹部未见占位" ,"肝胆未见异常")

肝囊肿<-c('肝多发囊肿','肝囊肿', "肝左叶囊肿", "肝小囊肿","肝囊肿（大小约1", 
       "肝内多发囊肿", "肝右叶囊肿","多发肝囊肿", "多发性肝囊肿")
胆结石<-c("胆囊结石", "胆囊多发结石", "胆结石", "肝内胆管结石")'
胆囊切除<-c("胆囊切除术后","胆囊切除","胆切除")
脾大<-c("脾大","脾稍大","脾肿大","肝大")
胆囊息肉<-c("胆囊息肉","胆囊多发息肉","胆囊息肉样病变","胆囊息肉不除外")

other<-c('1）','2）','8）','9）','0*0','6*0','7*0','(-)','4cm','3cm','5cm','6cm','1*0','1*1','2cm','5*1',
'7cm','9*0','9cm','直径0','0*1','2*1','3*1','5*0','6*1','8*0','8*1','8cm','0x1','2*2','2x1','3*0',
'4*1','7*2','（-)','0*2','0x0','5*2','5*3','5x0','9*1','0cm','1*2','1x0','1x1','2x0','3*2','3x1','6*4',
'6x0','7*6','7mm','7x0','8*2','8x2','0*3','1*3','1*4','1cm','1x5','2*0','2*4','2x2','3*5','3*7','3x2',
'3x8','4*0','4*2','4*4','4*7','4mm','4x1','4X4','5*4','5mm','5x1','6*2','6mm','6x1','7*1','7*7','7x4',
'8*3','8*5','8mm','8x0','9*3','9x0','何建英','充满型','占位？','大小1','7cm）','4cm）','3cm）','6cm）',
'0cm）','5cm）','1cm）','2cm）','8cm）','9cm）','6mm）','建议复查','3mm）','大小约0','4mm）','大小约1',
'（-—）','2mm）','5cm)','7cm)','8cm)','8mm）','0cm)','0mm）','34cm','4cm)','5mm）','9cm)','9mm）',
'最大约0','(——）','（——)','1mm）','28cm','2cm)','31cm','3cm)','41cm','44cm','49cm','5*11','63x0','66x0',
'69*0','69x0','6cm)','75x0','7mm）','98x0','FNH？','（-——）','2cm）2','0cm）2','15cm）','2cm*3','3cm)2',
'3cm*2','3mm*6','43cm）','45cm）','4cm)3','5cm）2','5cm直径','6cm）2','6cm*2','6mm*2','7,mm）','7cm）2',
'80cm）','8cm)3','8cm*0','9cm）2','9cm*0','最大约为0','副脾直径0','宽约6mm','2*6cm）','3*7cm）','35cm）2',
'3cm（多发）','6cm（单发）','6X1,5cm）','副脾15*9mm','大小约0。8*0','（大小约1。9X1',"（-）","（——）",' ')

word2$类型<-ifelse(word2$类型 %in% other,NA,word2$类型) 
#
word2%>%group_by(占位,类型)%>%
  summarise(n=n())%>%filter(n>50,!is.na(类型))%>%ggplot(aes(reorder(类型,n),n,fill=占位)) +
  geom_col(show.legend = FALSE) + facet_wrap(~占位, scales = "free_y") +
  theme(text=element_text(size=14))+
  coord_flip()
word2_list<-word2%>%group_by(类型)%>%summarise(n=n())%>%arrange(desc(n))
print(word2_list,n=40)

#export(word2_list,'~/word2_list.xlsx')

##word3 pivot_wider 再转换
word3<-word2%>%pivot_wider(names_from = 占位,values_from = 类型)%>%unnest()
head(word3)






